bench/results/10000_db.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/rank_ab.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 20s max duration (incl. graceful stop):
              * rank_ab: 30 looping VUs for 15s (gracefulStop: 5s)


running (01.0s), 30/30 VUs, 41 complete and 0 interrupted iterations
rank_ab   [   7% ] 30 VUs  01.0s/15s

running (02.0s), 30/30 VUs, 75 complete and 0 interrupted iterations
rank_ab   [  13% ] 30 VUs  02.0s/15s

running (03.0s), 30/30 VUs, 107 complete and 0 interrupted iterations
rank_ab   [  20% ] 30 VUs  03.0s/15s

running (04.0s), 30/30 VUs, 149 complete and 0 interrupted iterations
rank_ab   [  27% ] 30 VUs  04.0s/15s

running (05.0s), 30/30 VUs, 189 complete and 0 interrupted iterations
rank_ab   [  33% ] 30 VUs  05.0s/15s

running (06.0s), 30/30 VUs, 230 complete and 0 interrupted iterations
rank_ab   [  40% ] 30 VUs  06.0s/15s

running (07.0s), 30/30 VUs, 256 complete and 0 interrupted iterations
rank_ab   [  47% ] 30 VUs  07.0s/15s

running (08.0s), 30/30 VUs, 286 complete and 0 interrupted iterations
rank_ab   [  53% ] 30 VUs  08.0s/15s

running (09.0s), 30/30 VUs, 319 complete and 0 interrupted iterations
rank_ab   [  60% ] 30 VUs  09.0s/15s

running (10.0s), 30/30 VUs, 356 complete and 0 interrupted iterations
rank_ab   [  67% ] 30 VUs  10.0s/15s

running (11.0s), 30/30 VUs, 385 complete and 0 interrupted iterations
rank_ab   [  73% ] 30 VUs  11.0s/15s

running (12.0s), 30/30 VUs, 423 complete and 0 interrupted iterations
rank_ab   [  80% ] 30 VUs  12.0s/15s

running (13.0s), 30/30 VUs, 456 complete and 0 interrupted iterations
rank_ab   [  87% ] 30 VUs  13.0s/15s

running (14.0s), 30/30 VUs, 493 complete and 0 interrupted iterations
rank_ab   [  93% ] 30 VUs  14.0s/15s

running (15.0s), 30/30 VUs, 520 complete and 0 interrupted iterations
rank_ab   [ 100% ] 30 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 550     35.410154/s
    checks_succeeded...: 100.00% 550 out of 550
    checks_failed......: 0.00%   0 out of 550

    ✓ top30 200
    ✓ user_rank 200

    CUSTOM
    top30_latency..................: avg=783.05ms min=107.78ms med=780.17ms max=1.52s p(90)=1.05s p(95)=1.13s
    user_rank_latency..............: avg=942.64ms min=177.38ms med=950.6ms  max=1.88s p(90)=1.29s p(95)=1.36s

    HTTP
    http_req_duration..............: avg=834.99ms min=107.78ms med=826.65ms max=1.88s p(90)=1.16s p(95)=1.25s
      { expected_response:true }...: avg=834.99ms min=107.78ms med=826.65ms max=1.88s p(90)=1.16s p(95)=1.25s
    http_req_failed................: 0.00%  0 out of 550
    http_reqs......................: 550    35.410154/s

    EXECUTION
    iteration_duration.............: avg=835.43ms min=111.97ms med=826.79ms max=1.88s p(90)=1.16s p(95)=1.25s
    iterations.....................: 550    35.410154/s
    vus............................: 30     min=30       max=30
    vus_max........................: 30     min=30       max=30

    NETWORK
    data_received..................: 661 kB 43 kB/s
    data_sent......................: 44 kB  2.8 kB/s



running (15.5s), 00/30 VUs, 550 complete and 0 interrupted iterations
rank_ab ✓ [ 100% ] 30 VUs  15s